// © Copyright 2010-2015 HP Development Company, L.P.

// SSMDeviceWorkflowManager

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Сбой копирования рабочего процесса";
"COPY_WORKFLOWS_DESC" = "Не удалось скопировать рабочие процессы в папку домена устройства пользователя";

// generic error
"ERROR" = "Ошибка";
"ERROR_UNKNOWN_DESC" = "Произошла неизвестная ошибка.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Ошибка создания рабочего процесса";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "При создании рабочего процесса произошла неизвестная ошибка. Повторите попытку.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Ошибка создания каталога";
"ERROR_CREATING_DIR_DESC" = "Ошибка создания каталога %@. Проверьте права доступа к родительской папке и повторите попытку";

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Ярлык сканирования не поддерживается";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Выбранный ярлык сканирования нельзя использовать, пока он не будет распознан программным обеспечением. Выберите другой ярлык сканирования и повторите попытку.";

"Your HP device has sent a status message. This message could not be saved" = "Устройство HP отправило сообщение о состоянии. Это сообщение невозможно сохранить";
